tutorials/incompressible/simpleFoam/turbineSiting/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // actuationDisk1
    {
        name    actuationDisk1CellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (581850.5 4785805 1061) (581850.8 4785815 1071);
        }
    }
    {
        name    actuationDisk1;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set actuationDisk1CellSet;
        }
    }

    // actuationDisk2
    {
        name    actuationDisk2CellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (581754 4785658 1065) (581754.4 4785668 1075);
        }
    }
    {
        name    actuationDisk2;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set actuationDisk2CellSet;
        }
    }

);

// ************************************************************************* //
